externalSolarLoad4.5/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

runApplication blockMesh
# Set the initial fields
restore0Dir
runApplication viewFactorsGen
runApplication $(getApplication)

#------------------------------------------------------------------------------
