externalSolarLoad4.5/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    maxY
    {
        type            wall;
        inGroups        1(wall);
        nFaces          2400;
        startFace       281600;
    }
    minX
    {
        type            wall;
        inGroups        1(wall);
        nFaces          2400;
        startFace       284000;
    }
    maxX
    {
        type            wall;
        inGroups        1(wall);
        nFaces          2400;
        startFace       286400;
    }
    minY
    {
        type            wall;
        inGroups        1(wall);
        nFaces          2400;
        startFace       288800;
    }
    minZ
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1600;
        startFace       291200;
    }
    maxZ
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1600;
        startFace       292800;
    }
)

// ************************************************************************* //
